# Cleaning the NBA dataset

## Initial Inspection and Formatting

In [243]:
# Import dependencies
import pandas as pd
import numpy as np
import sqlalchemy
import warnings
warnings.filterwarnings("ignore")

from sqlalchemy import create_engine

#postgresql://user:password@localhost:5432/databasename
engine = sqlalchemy.create_engine('postgresql://postgres:gonoles@localhost:5432/Athletes_Career_Lifetimes')

In [244]:
# Read in the raw CSV file
raw_NBA=pd.read_csv("../../Data/DataSet/nba.csv")

In [245]:
# Inspect the dataframe columns/structure
raw_NBA.head()

,name,year_start,year_end,position,height,weight,birth_date,college
0,Alaa Abdelnaby,1991,1995,F-C,10-Jun,240.0,24-Jun-68,Duke University
1,Zaid Abdul-Aziz,1969,1978,C-F,9-Jun,235.0,7-Apr-46,Iowa State University
2,Kareem Abdul-Jabbar,1970,1989,C,2-Jul,225.0,16-Apr-47,"University of California, Los Angeles"
3,Mahmoud Abdul-Rauf,1991,2001,G,1-Jun,162.0,9-Mar-69,Louisiana State University
4,Tariq Abdul-Wahad,1998,2003,F,6-Jun,223.0,3-Nov-74,San Jose State University

In [246]:
# Drop the unecessary columns
del raw_NBA['height']
del raw_NBA['weight']
del raw_NBA['college']

In [247]:
# Determine counts per column
raw_NBA.count()

name          4541
year_start    4541
year_end      4541
position      4540
birth_date    4510
dtype: int64

#### The counts are not equal to eachother, which means there are likely null values for some entries

In [248]:
# Determine if there are null values
raw_NBA.isnull().sum()

name           0
year_start     0
year_end       0
position       1
birth_date    31
dtype: int64

#### From this result we can see that one entry does not have a value for 'position' and 'birthdate' and will need to be dropped.

In [249]:
# Drop the rows with null values
NBA_df = raw_NBA.dropna()

In [250]:
# We check the count again
NBA_df.isnull().sum()

name          0
year_start    0
year_end      0
position      0
birth_date    0
dtype: int64

In [251]:
NBA_df.count()

name          4509
year_start    4509
year_end      4509
position      4509
birth_date    4509
dtype: int64

#### Now we have only the columns we need and no null entries

In [252]:
NBA_df.head()

                  name  year_start  year_end position birth_date
0       Alaa Abdelnaby        1991      1995      F-C  24-Jun-68
1      Zaid Abdul-Aziz        1969      1978      C-F   7-Apr-46
2  Kareem Abdul-Jabbar        1970      1989        C  16-Apr-47
3   Mahmoud Abdul-Rauf        1991      2001        G   9-Mar-69
4    Tariq Abdul-Wahad        1998      2003        F   3-Nov-74

## Data Analysis

### Position Column

#### For our code to run, I am going to take the position column and reformat as a list of indices, so we have a numeric equivalent: first let's check to see which positions are present in the dataset

In [253]:
NBA_df['position'].unique()

array(['F-C', 'C-F', 'C', 'G', 'F', 'G-F', 'F-G'], dtype=object)

#### Based on the above, the following indecies will be applied:
##### 0 = multiple positions
##### 1 = Center
##### 2 = Guard
##### 3 = Forward

In [254]:
#for index, row in NBA_df.iterrows():
    
 #   if len(row['position']) > 1:
  #      NBA_df['position'][index] = 0
        
  #  elif row['position'] == 'C':
   #     NBA_df['position'][index] = 1
    
   # elif row['position'] == 'G':
   #     NBA_df['position'][index] = 2
        
   # else: 
   #     NBA_df['position'][index] = 3

In [255]:
for index, row in NBA_df.iterrows():
    
    if len(row['position']) > 1:
        NBA_df['position'][index] = 'multi'

In [256]:
# Make dataframe column from result
posns = NBA_df['position']

In [257]:
# Check the dataframe
posns.head()

0    multi
1    multi
2        C
3        G
4        F
Name: position, dtype: object

In [258]:
NBA_df.head()

                  name  year_start  year_end position birth_date
0       Alaa Abdelnaby        1991      1995    multi  24-Jun-68
1      Zaid Abdul-Aziz        1969      1978    multi   7-Apr-46
2  Kareem Abdul-Jabbar        1970      1989        C  16-Apr-47
3   Mahmoud Abdul-Rauf        1991      2001        G   9-Mar-69
4    Tariq Abdul-Wahad        1998      2003        F   3-Nov-74

### Retirement Year/Years played

#### The retirement year is already included as a column, but we can use it along with the start year to calculate the career length

In [259]:
# Extract the columns into an array
year_start = NBA_df['year_start']
year_end = NBA_df['year_end']

# Calculate career length from start/end year (add one to account for players who start/stop in same year)
years_played = year_end - year_start + 1

In [260]:
# Check values
years_tot = pd.DataFrame(years_played)

### Age of retirement

#### For the final calculation, we will need to extract the birth year and reformat the age of retirement.

In [261]:
# Temporary 'dummy' array to hold last two charachters of birth_date string
temp=[]

# Iterate through 'birth_date' column 
for index, row in NBA_df.iterrows():
    
    # Grab the last two characters, convert to int and add 1900 to make it compatible with retirement age year
    temp.append(int(row['birth_date'][-2:])+ 1900)

In [262]:
len(temp)

4509

In [263]:
# Make a dataFrame from the result
birth_year=pd.DataFrame(temp)
birth_year.columns = ['birth_year']

In [264]:
len(birth_year)

4509

In [265]:
len(NBA_df['year_end'])

4509

In [266]:
# Check dataframe
birth_year.head()

   birth_year
0        1968
1        1946
2        1947
3        1969
4        1974

In [267]:
# Calculate the age of retirement
age_retired = NBA_df['year_end'] - birth_year['birth_year']

In [268]:
# Calculate the age of retirement
age_started = NBA_df['year_start'] - birth_year['birth_year']

In [269]:
temp2 = []

for index, row in NBA_df.iterrows():
    
    temp2.append('NBA')

In [270]:
sport_list = pd.DataFrame(temp2)
sport_list.columns = ['Sport']
sport_name=sport_list['Sport']

In [271]:
name_list = NBA_df['name']

In [272]:
NBA_summary_df = pd.DataFrame({
    'player_ID'   : name_list,
    'sport'       : sport_name,
    'position'    : posns,
    'start_year' : year_start,
    'start_age'  : age_started,
    'retire_year' : year_end,
    'retire_age'  : age_retired,
    'years_played': years_played})

In [273]:
NBA_df_filtered = NBA_summary_df[NBA_summary_df['retire_age'] >= 19]

In [274]:
NBA_df_filtered = NBA_df_filtered[NBA_df_filtered['retire_age'] <= 59]

In [275]:
NBA_df_filtered.dropna()

,player_ID,sport,position,start_year,start_age,retire_year,retire_age,years_played
0,Alaa Abdelnaby,NBA,multi,1991.0,23.0,1995.0,27.0,5.0
1,Zaid Abdul-Aziz,NBA,multi,1969.0,23.0,1978.0,32.0,10.0
2,Kareem Abdul-Jabbar,NBA,C,1970.0,23.0,1989.0,42.0,20.0
3,Mahmoud Abdul-Rauf,NBA,G,1991.0,22.0,2001.0,32.0,11.0
4,Tariq Abdul-Wahad,NBA,F,1998.0,24.0,2003.0,29.0,6.0
...,...,...,...,...,...,...,...,...
4499,Sharone Wright,NBA,multi,1995.0,18.0,1998.0,21.0,4.0
4500,Tony Wroten,NBA,G,2013.0,40.0,2016.0,43.0,4.0
4503,Guerschon Yabusele,NBA,F,2018.0,24.0,2018.0,24.0,1.0
4506,Barry Yates,NBA,F,1972.0,24.0,1972.0,24.0,1.0
4508,Charlie Yelverton,NBA,multi,1972.0,53.0,1972.0,53.0,1.0

In [276]:
NBA_df_filtered['start_year'] = NBA_df_filtered['start_year'].map("{:.0f}".format)

NBA_df_filtered['start_age'] = NBA_df_filtered['start_age'].map("{:.0f}".format)

NBA_df_filtered['retire_year'] = NBA_df_filtered['retire_year'].map("{:.0f}".format)

NBA_df_filtered['retire_age'] = NBA_df_filtered['retire_age'].map("{:.0f}".format)

NBA_df_filtered['years_played'] = NBA_df_filtered['years_played'].map("{:.0f}".format)

In [277]:
NBA_df_filtered.dropna()

,player_ID,sport,position,start_year,start_age,retire_year,retire_age,years_played
0,Alaa Abdelnaby,NBA,multi,1991,23,1995,27,5
1,Zaid Abdul-Aziz,NBA,multi,1969,23,1978,32,10
2,Kareem Abdul-Jabbar,NBA,C,1970,23,1989,42,20
3,Mahmoud Abdul-Rauf,NBA,G,1991,22,2001,32,11
4,Tariq Abdul-Wahad,NBA,F,1998,24,2003,29,6
...,...,...,...,...,...,...,...,...
4499,Sharone Wright,NBA,multi,1995,18,1998,21,4
4500,Tony Wroten,NBA,G,2013,40,2016,43,4
4503,Guerschon Yabusele,NBA,F,2018,24,2018,24,1
4506,Barry Yates,NBA,F,1972,24,1972,24,1
4508,Charlie Yelverton,NBA,multi,1972,53,1972,53,1

In [278]:
NBA_df_filtered.drop_duplicates()

,player_ID,sport,position,start_year,start_age,retire_year,retire_age,years_played
0,Alaa Abdelnaby,NBA,multi,1991,23,1995,27,5
1,Zaid Abdul-Aziz,NBA,multi,1969,23,1978,32,10
2,Kareem Abdul-Jabbar,NBA,C,1970,23,1989,42,20
3,Mahmoud Abdul-Rauf,NBA,G,1991,22,2001,32,11
4,Tariq Abdul-Wahad,NBA,F,1998,24,2003,29,6
...,...,...,...,...,...,...,...,...
4499,Sharone Wright,NBA,multi,1995,18,1998,21,4
4500,Tony Wroten,NBA,G,2013,40,2016,43,4
4503,Guerschon Yabusele,NBA,F,2018,24,2018,24,1
4506,Barry Yates,NBA,F,1972,24,1972,24,1
4508,Charlie Yelverton,NBA,multi,1972,53,1972,53,1

In [279]:
NBA_df_start = NBA_df_filtered.drop(['retire_year','retire_age'], axis = 1)

In [280]:
NBA_df_start = NBA_df_start.drop_duplicates(subset=['player_ID'])

In [281]:
NBA_df_start.head()

             player_ID sport position start_year start_age years_played
0       Alaa Abdelnaby   NBA    multi       1991        23            5
1      Zaid Abdul-Aziz   NBA    multi       1969        23           10
2  Kareem Abdul-Jabbar   NBA        C       1970        23           20
3   Mahmoud Abdul-Rauf   NBA        G       1991        22           11
4    Tariq Abdul-Wahad   NBA        F       1998        24            6

In [282]:
#NBA_df_start.to_csv('../../Data/Clean_Data/clean_start_nba.csv', index = False)

In [283]:
NBA_df_end = NBA_df_filtered.drop(['start_year','start_age'], axis = 1)

In [284]:
NBA_df_end = NBA_df_end.drop_duplicates(subset=['player_ID'])

In [285]:
NBA_df_end

                player_ID sport position retire_year retire_age years_played
0          Alaa Abdelnaby   NBA    multi        1995         27            5
1         Zaid Abdul-Aziz   NBA    multi        1978         32           10
2     Kareem Abdul-Jabbar   NBA        C        1989         42           20
3      Mahmoud Abdul-Rauf   NBA        G        2001         32           11
4       Tariq Abdul-Wahad   NBA        F        2003         29            6
...                   ...   ...      ...         ...        ...          ...
4499       Sharone Wright   NBA    multi        1998         21            4
4500          Tony Wroten   NBA        G        2016         43            4
4503   Guerschon Yabusele   NBA        F        2018         24            1
4506          Barry Yates   NBA        F        1972         24            1
4508    Charlie Yelverton   NBA    multi        1972         53            1

[2147 rows x 6 columns]

In [286]:
NBA_df_start['start_year'] = NBA_df_start['start_year'].astype('int64')
NBA_df_start['start_age'] = NBA_df_start['start_age'].astype('int64')
NBA_df_start['years_played'] = NBA_df_start['years_played'].astype('int64')

NBA_df_end['retire_year'] = NBA_df_end['retire_year'].astype('int64')
NBA_df_end['retire_age'] = NBA_df_end['retire_age'].astype('int64')
NBA_df_end['years_played'] = NBA_df_end['years_played'].astype('int64')

In [287]:
NBA_df_start.dtypes

player_ID       object
sport           object
position        object
start_year       int64
start_age        int64
years_played     int64
dtype: object

In [288]:
#NBA_df_end.to_csv('../../Data/Clean_Data/clean_retire_nba.csv', index = False)

In [289]:
#export to sql db from first cell
NBA_df_start.to_sql(
    name='nba_starting',
    con=engine,
    index=False,
    if_exists='replace'
)

NBA_df_end.to_sql(
    name='nba_retiring',
    con=engine,
    index=False,
    if_exists='replace'
)